swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash_sec.c
/**************************************************************************//**
 * @file     rtl8735b_flash_sec.c
 * @brief    Implement flash security IP (SEC) ROM code functions.
 *
 * @version  V1.00
 * @date     2021-07-13
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

// TODO add doxygen
/**
  \brief todo
*/
#include "cmsis.h"

#ifdef CONFIG_FLASH_SEC_EN

#include "basic_types.h"
#include "rtl8735b.h"
#include "rtl8735b_flash_sec.h"

#define SECTION_FLASHSEC_TEXT           SECTION(".rom.hal_flash_sec.text")
#define SECTION_FLASHSEC_DATA           SECTION(".rom.hal_flash_sec.data")
#define SECTION_FLASHSEC_RODATA         SECTION(".rom.hal_flash_sec.rodata")
#define SECTION_FLASHSEC_BSS            SECTION(".rom.hal_flash_sec.bss")
#define SECTION_FLASHSEC_STUBS          SECTION(".rom.hal_flash_sec.stubs")
#define SECTION_FLASHSEC_EXT_STUBS      SECTION(".rom.hal_flash_sec_extend.stubs")


// TODO notes
// volatile
// API for BootLoader
// No use READ32 and WRITE32

// TODO No magic number
#define FLASH_SEC_SEC_LOCK_CTRL_PTN     0x0DC

// FIXME Remove me??
//SECTION_FLASHSEC_RODATA
//FLASH_SEC_TypeDef *flash_sec_regs = FLASH_SEC;
#define flash_sec_regs                  FLASH_SEC

// TODO add more api disable/enable, init

SECTION_FLASHSEC_STUBS
const hal_flash_sec_func_stubs_t hal_flash_sec_stubs = {
	.hal_flash_sec_get_status = hal_rtl_flash_sec_get_status,
	.hal_flash_sec_get_cid = hal_rtl_flash_sec_get_cid,
	.hal_flash_sec_get_err_addr = hal_rtl_flash_sec_get_err_addr,

	.hal_flash_sec_aes_enable = hal_rtl_flash_sec_aes_enable,
	.hal_flash_sec_aes_disable = hal_rtl_flash_sec_aes_disable,

	.hal_flash_sec_clr_intr = hal_rtl_flash_sec_clr_intr,
	.hal_flash_sec_set_ctrl = hal_rtl_flash_sec_set_ctrl,
	.hal_flash_sec_gcm_key_init = hal_rtl_flash_sec_gcm_key_init,
	.hal_flash_sec_dec_key_init = hal_rtl_flash_sec_dec_key_init,
	.hal_flash_sec_clean_cache = hal_rtl_flash_sec_clean_cache,
	.hal_flash_sec_lock = hal_rtl_flash_sec_lock,

	.hal_flash_sec_remap_region = hal_rtl_flash_sec_remap_region,
	.hal_flash_sec_disable_remap_region = hal_rtl_flash_sec_disable_remap_region,

	.hal_flash_sec_decrypt_region = hal_rtl_flash_sec_decrypt_region,
	.hal_flash_sec_disable_decrypt_region = hal_rtl_flash_sec_disable_decrypt_region,

	.hal_flash_sec_set_tag_base = hal_rtl_flash_sec_set_tag_base,
	.hal_flash_sec_set_iv = hal_rtl_flash_sec_set_iv,

	// Get reg
	.hal_flash_sec_get_remap_region = hal_rtl_flash_sec_get_remap_region,
	.hal_flash_sec_get_decrypt_region = hal_rtl_flash_sec_get_decrypt_region,
	.hal_flash_sec_get_tag_base = hal_rtl_flash_sec_get_tag_base,
	.hal_flash_sec_get_iv = hal_rtl_flash_sec_get_iv
};

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_FLASHSEC_EXT_STUBS
const hal_flash_sec_extend_func_stubs_t hal_flash_sec_ext_stubs = {
	.hal_flash_sec_enable_remap_region = hal_rtl_flash_sec_enable_remap_region,
	.hal_flash_sec_calculate_tag_base = hal_rtl_flash_sec_calculate_tag_base,
	.hal_flash_sec_decrypt_init = hal_rtl_flash_sec_decrypt_init,
	.hal_flash_sec_decrypt_region_init = hal_rtl_flash_sec_decrypt_region_init,
	.hal_flash_sec_decrypt_region_enable = hal_rtl_flash_sec_decrypt_region_enable,
	.hal_flash_sec_set_word_from_byte_bigen = hal_rtl_flash_sec_set_word_from_byte_bigen,
};
#endif

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_get_status(hal_flash_sec_status_t *status)
{
	u32 reg_val = flash_sec_regs->FLASH_SEC_SEC_STS_REG;
	status->idle                = (reg_val & FLASH_SEC_BIT_IDLE) >> FLASH_SEC_SHIFT_IDLE;
	status->key_init_done       = (reg_val & FLASH_SEC_BIT_KEY_INIT_DONE) >> FLASH_SEC_SHIFT_KEY_INIT_DONE;
	status->intr_err_tag        = (reg_val & FLASH_SEC_BIT_INTR_ERR_TAG) >> FLASH_SEC_SHIFT_INTR_ERR_TAG;
	status->intr_err_resp       = (reg_val & FLASH_SEC_BIT_INTR_ERR_RESP) >> FLASH_SEC_SHIFT_INTR_ERR_RESP;
	status->intr_err_apb        = (reg_val & FLASH_SEC_BIT_INTR_ERR_APB) >> FLASH_SEC_SHIFT_INTR_ERR_APB;
	status->intr_err_init       = (reg_val & FLASH_SEC_BIT_INTR_ERR_INIT) >> FLASH_SEC_SHIFT_INTR_ERR_INIT;
	status->remap_region_error  = (reg_val & FLASH_SEC_BIT_REMAP_REGN_ERR) >> FLASH_SEC_SHIFT_REMAP_REGN_ERR;
	status->remap_addr_error    = (reg_val & FLASH_SEC_BIT_REMAP_ADDR_ERR) >> FLASH_SEC_SHIFT_REMAP_ADDR_ERR;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_get_cid(hal_flash_sec_cid_t *cid)
{
	u32 reg_val = flash_sec_regs->FLASH_SEC_SEC_CID_REG;
	cid->decrypt_region_num = (reg_val & FLASH_SEC_MASK_REGN_NUMBER) >> FLASH_SEC_SHIFT_REGN_NUMBER;
	cid->iv_num             = (reg_val & FLASH_SEC_MASK_IV_NUMBER) >> FLASH_SEC_SHIFT_IV_NUMBER;
	cid->support_ctr        = (reg_val & FLASH_SEC_BIT_SPRT_CTR) >> FLASH_SEC_SHIFT_SPRT_CTR;
	cid->support_mix        = (reg_val & FLASH_SEC_BIT_SPRT_ECB_MIX) >> FLASH_SEC_SHIFT_SPRT_ECB_MIX;
	cid->support_gcm        = (reg_val & FLASH_SEC_BIT_SPRT_GCM) >> FLASH_SEC_SHIFT_SPRT_GCM;
	cid->key_source         = (reg_val & FLASH_SEC_BIT_KEY_SRC) >> FLASH_SEC_SHIFT_KEY_SRC;
	u8 cache_line_bits      = (reg_val & FLASH_SEC_MASK_LINE_SIZE) >> FLASH_SEC_SHIFT_LINE_SIZE;
	switch (cache_line_bits) {
	case 0:
		cid->cache_line_size    = FLASH_SEC_CACHE_16;
		break;
	case 1:
		cid->cache_line_size    = FLASH_SEC_CACHE_32;
		break;
	case 2:
		cid->cache_line_size    = FLASH_SEC_CACHE_64;
		break;
	case 3:
		cid->cache_line_size    = FLASH_SEC_CACHE_128;
		break;
	}
}

SECTION_FLASHSEC_TEXT
u32 hal_rtl_flash_sec_get_err_addr(void)
{
	return flash_sec_regs->FLASH_SEC_SEC_ERR_ADDR_REG;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_clr_intr(void)
{
	flash_sec_regs->FLASH_SEC_SEC_CLR_INT_REG |= 0x01;
}

// Control reg
SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_aes_enable(void)
{
	HAL_SET_BIT(flash_sec_regs->FLASH_SEC_SEC_CTRL_REG, FLASH_SEC_BIT_AES_EN);
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_aes_disable(void)
{
	HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CTRL_REG, FLASH_SEC_BIT_AES_EN);
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_set_ctrl(hal_flash_sec_adapter_t *adtr)
{
	u32 reg_val = flash_sec_regs->FLASH_SEC_SEC_CTRL_REG;

	// Save only enable
	reg_val &= FLASH_SEC_BIT_AES_EN;

	u32 key_size_bits, tag_size_bits;

	switch (adtr->tag_size) {
	case FLASH_SEC_TAG_4:
		tag_size_bits = 0;
		break;
	case FLASH_SEC_TAG_8:
		tag_size_bits = 1;
		break;
	case FLASH_SEC_TAG_16:
		tag_size_bits = 2;
		break;
	default:
		return HAL_ERR_PARA;
	}
	switch (adtr->key_size) {
	case FLASH_SEC_KEY_128:
		key_size_bits = 0;
		break;
	case FLASH_SEC_KEY_192:
		key_size_bits = 1;
		break;
	case FLASH_SEC_KEY_256:
		key_size_bits = 2;
		break;
	default:
		return HAL_ERR_PARA;
	}
	reg_val |= (tag_size_bits << FLASH_SEC_SHIFT_TAG_SIZE) & FLASH_SEC_MASK_TAG_SIZE;
	reg_val |= (adtr->axi_byte_swap << FLASH_SEC_SHIFT_AXI_BYTE_SWAP) & FLASH_SEC_BIT_AXI_BYTE_SWAP;
	reg_val |= (adtr->axi_word_swap << FLASH_SEC_SHIFT_AXI_WORD_SWAP) & FLASH_SEC_BIT_AXI_WORD_SWAP;
	reg_val |= (key_size_bits << FLASH_SEC_SHIFT_KEY_SIZE) & FLASH_SEC_MASK_KEY_SIZE;
	// Set enable bit with other apis
	//reg_val |= (adtr->aes_enable << FLASH_SEC_SHIFT_AES_EN) & FLASH_SEC_BIT_AES_EN;
	reg_val |= (adtr->line_buffer_icg_dis << FLASH_SEC_SHIFT_ICG_CTRL_0) & FLASH_SEC_BIT_ICG_CTRL_0;
	reg_val |= (adtr->fetch_unit_icg_dis << FLASH_SEC_SHIFT_ICG_CTRL_1) & FLASH_SEC_BIT_ICG_CTRL_1;
	reg_val |= (adtr->apb_ctrl_icg_dis << FLASH_SEC_SHIFT_ICG_CTRL_2) & FLASH_SEC_BIT_ICG_CTRL_2;
	reg_val |= (adtr->key_reg_icg_dis << FLASH_SEC_SHIFT_ICG_CTRL_3) & FLASH_SEC_BIT_ICG_CTRL_3;
	flash_sec_regs->FLASH_SEC_SEC_CTRL_REG = reg_val;
	return HAL_OK;
}

// Maintenance reg
SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_gcm_key_init(void)
{
	flash_sec_regs->FLASH_SEC_SEC_MAINTAIN_OP_REG |= FLASH_SEC_BIT_GCM_KEY_INIT;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_dec_key_init(void)
{
	flash_sec_regs->FLASH_SEC_SEC_MAINTAIN_OP_REG |= FLASH_SEC_BIT_DEC_KEY_INIT;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_clean_cache(void)
{
	flash_sec_regs->FLASH_SEC_SEC_MAINTAIN_OP_REG |= FLASH_SEC_BIT_CLEAN_CACHE_LINE;
}
// End of Maintenance


SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_lock(void)
{
	flash_sec_regs->FLASH_SEC_SEC_LOCK_CTRL_REG = FLASH_SEC_SEC_LOCK_CTRL_PTN;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_set_tag_base(u32 tag_base_addr)
{
	flash_sec_regs->FLASH_SEC_SEC_GCM_TAG_BASE_REG = tag_base_addr;
}

// TODO move the adtr to ram??
SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_remap_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->remap_region_sel;
	u8 enable = adtr->remap_region_enable;
	u32 va_base = adtr->va_base;
	u32 pa_base = adtr->pa_base;
	u32 va_end = (u32)adtr->va_base + (u32)adtr->remap_region_size - 1;

