swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash_sec.c
	u32 va_base_page = GET_PAGE(va_base);
	u32 va_end_page = GET_PAGE(va_end);
	volatile u32 addr_val = 0;
	addr_val |= (va_base_page << FLASH_SEC_SHIFT_REMAP_BASE_0_ADDR) & FLASH_SEC_MASK_REMAP_BASE_0_ADDR;
	addr_val |= (va_end_page << FLASH_SEC_SHIFT_REMAP_END_0_ADDR) & FLASH_SEC_MASK_REMAP_END_0_ADDR;

	u32 pa_base_page = GET_PAGE(pa_base);
	volatile u32 offset_val = 0;
	offset_val |= ((u32)enable << FLASH_SEC_SHIFT_REMAP_0_ENABLE) & FLASH_SEC_BIT_REMAP_0_ENABLE;
	offset_val |= (pa_base_page << FLASH_SEC_SHIFT_REMAP_0_OFFSET) & FLASH_SEC_MASK_REMAP_0_OFFSET;

	switch (region_id) {
	case 0:
		flash_sec_regs->FLASH_SEC_SEC_REMAP0_ADDR_REG = addr_val;
		flash_sec_regs->FLASH_SEC_SEC_REMAP0_OFFSET_REG = offset_val;
		break;
	case 1:
		flash_sec_regs->FLASH_SEC_SEC_REMAP1_ADDR_REG = addr_val;
		flash_sec_regs->FLASH_SEC_SEC_REMAP1_OFFSET_REG = offset_val;
		break;
	case 2:
		flash_sec_regs->FLASH_SEC_SEC_REMAP2_ADDR_REG = addr_val;
		flash_sec_regs->FLASH_SEC_SEC_REMAP2_OFFSET_REG = offset_val;
		break;
	case 3:
		flash_sec_regs->FLASH_SEC_SEC_REMAP3_ADDR_REG = addr_val;
		flash_sec_regs->FLASH_SEC_SEC_REMAP3_OFFSET_REG = offset_val;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	return HAL_OK;
}

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)

SECTION_FLASHSEC_TEXT
uint8_t hal_rtl_flash_sec_check_addr_region(uint32_t base, uint32_t size)
{
	uint32_t end = 0x0;
	if ((base & PAGE_OFFSET_MASK) || (base < FLASH_ACCESS_BASE)) {
		return 1;
	}

	if (size & PAGE_OFFSET_MASK) {
		return 1;
	}
	end = base + size;
	if (end > FLASH_MAX_END) {
		return 1;
	}
	return 0;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_check_rom_error(hal_flash_sec_adapter_t *adtr)
{
	hal_flash_sec_status_t *psec_status = NULL;
	psec_status = &(adtr->sec_status);
	hal_rtl_flash_sec_get_status(psec_status);

	if (1 == psec_status->remap_region_error) {
		return HAL_ERR_UNKNOWN;
	} else if (1 == psec_status->remap_addr_error) {
		return HAL_ERR_UNKNOWN;
	} else if (1 == psec_status->intr_err_apb) {
		return HAL_ERR_UNKNOWN;
	} else if (1 == psec_status->intr_err_tag) {
		return HAL_ERR_UNKNOWN;
	} else if (1 == psec_status->intr_err_resp) {
		return HAL_ERR_UNKNOWN;
	} else if (1 == psec_status->intr_err_init) {
		return HAL_ERR_UNKNOWN;
	}
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_calculate_tag_base(uint32_t cache_line_size, uint32_t tag_size,
		uint32_t flash_addr, uint32_t region_size, uint32_t tag_region_addr,
		uint32_t *tag_base, uint32_t *tag_region_size)
{
	hal_status_t ret = HAL_OK;
	uint32_t ratio = 0x0, tag_offset = 0x0;

	if (cache_line_size % tag_size != 0) {
		dbg_printf("calculate_tag_base arg error: cache %% tag != 0");
		ret = HAL_ERR_PARA;
		return ret;
	}
	ratio = cache_line_size / tag_size;
	if (NULL != tag_region_size) {
		*tag_region_size = region_size / ratio;
	}

	tag_offset = (flash_addr & FLASH_OFFSET_MASK) / ratio;
	if (NULL != tag_base) {
		*tag_base = tag_region_addr - tag_offset;
	}
	return ret;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_default_calculate_tag_base(uint32_t flash_addr, uint32_t region_size,
		uint32_t tag_region_addr, uint32_t *tag_base,
		uint32_t *tag_region_size)
{
	hal_status_t ret = HAL_OK;
	ret = hal_rtl_flash_sec_calculate_tag_base(FLASH_SEC_CACHE_32, FLASH_SEC_TAG_4, flash_addr, region_size,
			tag_region_addr, tag_base, tag_region_size);
	return ret;
}


SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_enable_remap_region(hal_flash_sec_adapter_t *adtr, uint8_t rmp_region_sel,
		uint32_t va_base, uint32_t pa_base, uint32_t region_size)
{
	hal_status_t ret;
	uint32_t va_end = 0xFFFFFFFF;
	uint32_t pa_end = 0xFFFFFFFF;

	// check options
	if (adtr == NULL) {
		return HAL_ERR_MEM;
	}
	if (adtr->remap_region_sel >= FLASH_SEC_REMAP_REGION_MAX) {
		return HAL_ERR_PARA;
	}
	if (hal_rtl_flash_sec_check_addr_region(va_base, region_size)) {
		return HAL_ERR_PARA;
	}
	if (hal_rtl_flash_sec_check_addr_region(pa_base, region_size)) {
		return HAL_ERR_PARA;
	}

	va_end = va_base + region_size;
	pa_end = pa_base + region_size;

	// check overlap
	if (va_base > pa_base) {
		if (pa_end > va_base) {
			return HAL_ERR_PARA;
		}
	} else if (va_base < pa_base) {
		if (va_end > pa_base) {
			return HAL_ERR_PARA;
		}
	} else {
		return HAL_ERR_PARA;
	}

	adtr->va_base = va_base;
	adtr->pa_base = pa_base;
	adtr->remap_region_size   = region_size;
	adtr->remap_region_sel    = rmp_region_sel;
	adtr->remap_region_enable = ENABLE;

	ret = hal_rtl_flash_sec_remap_region(adtr);
	if (ret == HAL_OK) {
		return hal_rtl_flash_sec_check_rom_error(adtr);
	}
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_disable_rmp_region(hal_flash_sec_adapter_t *adtr, uint8_t rmp_region_sel)
{
	hal_status_t ret = HAL_OK;
	if (adtr == NULL) {
		return HAL_ERR_MEM;
	}
	adtr->remap_region_sel = rmp_region_sel;
	ret = hal_rtl_flash_sec_disable_remap_region(adtr);
}

#endif

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_disable_remap_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->remap_region_sel;
	switch (region_id) {
	case 0:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_REMAP0_OFFSET_REG, FLASH_SEC_BIT_REMAP_0_ENABLE);
		break;
	case 1:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_REMAP1_OFFSET_REG, FLASH_SEC_BIT_REMAP_1_ENABLE);
		break;
	case 2:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_REMAP2_OFFSET_REG, FLASH_SEC_BIT_REMAP_2_ENABLE);
		break;
	case 3:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_REMAP3_OFFSET_REG, FLASH_SEC_BIT_REMAP_3_ENABLE);
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_set_iv(hal_flash_sec_adapter_t *adtr)
{
	u8 iv_sel = adtr->iv_sel;
	u32 iv_low = adtr->iv_low;
	u32 iv_high = adtr->iv_high;

	switch (iv_sel) {
	case 0:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV0_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV0_HIGH_REG = iv_high;
		break;
	case 1:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV1_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV1_HIGH_REG = iv_high;
		break;
	case 2:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV2_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV2_HIGH_REG = iv_high;
		break;
	case 3:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV3_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV3_HIGH_REG = iv_high;
		break;
	case 4:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV4_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV4_HIGH_REG = iv_high;
		break;
	case 5:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV5_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV5_HIGH_REG = iv_high;
		break;
	case 6:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV6_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV6_HIGH_REG = iv_high;
		break;
	case 7:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV7_LOW_REG = iv_low;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV7_HIGH_REG = iv_high;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	return HAL_OK;
}

// change arg to region size
SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_decrypt_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->decrypt_region_sel;
	u8 enable = adtr->decrypt_region_enable;
	u8 cipher_mode = adtr->cipher;
	u8 iv_sel = adtr->iv_sel;
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	u32 va_base = adtr->va_base;
	u32 va_end = (u32)adtr->va_base + (u32)adtr->decrypt_region_size - 1;

