swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_flash_sec.c
	u32 va_base_page = GET_PAGE(va_base);
	u32 region_base_val = (va_base_page << FLASH_SEC_SHIFT_REGN_0_BASE) & FLASH_SEC_MASK_REGN_0_BASE;

	u32 va_end_page = GET_PAGE(va_end);
	u32 region_end_val = 0;
	region_end_val |= ((u32)enable << FLASH_SEC_SHIFT_REGN_0_ENABLE) & FLASH_SEC_BIT_REGN_0_ENABLE;
	region_end_val |= ((u32)cipher_mode << FLASH_SEC_SHIFT_REGN_0_MODE) & FLASH_SEC_MASK_REGN_0_MODE;
	region_end_val |= ((u32)iv_sel << FLASH_SEC_SHIFT_REGN_0_IV_NUM) & FLASH_SEC_MASK_REGN_0_IV_NUM;
	region_end_val |= (va_end_page << FLASH_SEC_SHIFT_REGN_0_END) & FLASH_SEC_MASK_REGN_0_END;
#else
	u32 dec_base = adtr->dec_base;
	u32 dec_end = (u32)adtr->dec_base + (u32)adtr->decrypt_region_size - 1;

	u32 dec_base_page = GET_PAGE(dec_base);
	u32 region_base_val = (dec_base_page << FLASH_SEC_SHIFT_REGN_0_BASE) & FLASH_SEC_MASK_REGN_0_BASE;

	u32 dec_end_page = GET_PAGE(dec_end);
	u32 region_end_val = 0;
	region_end_val |= ((u32)enable << FLASH_SEC_SHIFT_REGN_0_ENABLE) & FLASH_SEC_BIT_REGN_0_ENABLE;
	region_end_val |= ((u32)cipher_mode << FLASH_SEC_SHIFT_REGN_0_MODE) & FLASH_SEC_MASK_REGN_0_MODE;
	region_end_val |= ((u32)iv_sel << FLASH_SEC_SHIFT_REGN_0_IV_NUM) & FLASH_SEC_MASK_REGN_0_IV_NUM;
	region_end_val |= (dec_end_page << FLASH_SEC_SHIFT_REGN_0_END) & FLASH_SEC_MASK_REGN_0_END;
#endif
	switch (region_id) {
	case 0:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION0_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION0_END_REG = region_end_val;
		break;
	case 1:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION1_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION1_END_REG = region_end_val;
		break;
	case 2:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION2_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION2_END_REG = region_end_val;
		break;
	case 3:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION3_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION3_END_REG = region_end_val;
		break;
	case 4:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION4_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION4_END_REG = region_end_val;
		break;
	case 5:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION5_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION5_END_REG = region_end_val;
		break;
	case 6:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION6_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION6_END_REG = region_end_val;
		break;
	case 7:
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION7_BASE_REG = region_base_val;
		flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION7_END_REG = region_end_val;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	return HAL_OK;
}

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_FLASHSEC_TEXT
uint32_t hal_rtl_flash_sec_set_word_from_byte_bigen(const unsigned char *s_value)
{
	volatile uint32_t val = 0x0;
	(val) = (((uint32_t)(s_value)[0] << 24)
			 | ((uint32_t)(s_value)[1] << 16)
			 | ((uint32_t)(s_value)[2] <<  8)
			 | ((uint32_t)(s_value)[3]));
	return val;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_decrypt_key_sel(hal_flash_sec_adapter_t *adtr, uint8_t key_sel)
{
	volatile uint32_t reg_val = 0x0;
	reg_val |= SYSON_S_BIT_FLASH_SEC_KEY_RDY_EN;
	reg_val |= (key_sel << SYSON_S_SHIFT_SCE_KEY_SEL) & SYSON_S_MASK_SCE_KEY_SEL;
	SYSON_S->SYSON_S_REG_SYS_SEC_CTRL = reg_val;
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_decrypt_init(hal_flash_sec_adapter_t *adtr, const uint8_t key_sel, uint32_t key_size,
		uint32_t cache_line_size, uint32_t tag_size)
{
	hal_status_t ret = HAL_OK;
	if (adtr == NULL) {
		ret = HAL_ERR_MEM;
		return ret;
	}

	adtr->key_size = key_size;
	adtr->cache_line_size = cache_line_size;
	adtr->tag_size = tag_size;

	ret = hal_rtl_flash_sec_set_ctrl(adtr);
	if (ret != HAL_OK) {
		return ret;
	}

	ret = hal_rtl_flash_sec_decrypt_key_sel(adtr, key_sel);
	if (ret != HAL_OK) {
		return ret;
	}
	return ret;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_default_decrypt_init(hal_flash_sec_adapter_t *adtr, const uint8_t key_sel)
{
	hal_status_t ret = HAL_OK;
	ret = hal_rtl_flash_sec_decrypt_init(adtr, key_sel, FLASH_SEC_KEY_256, FLASH_SEC_CACHE_32, FLASH_SEC_TAG_4);
	return ret;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_decrypt_region_init(hal_flash_sec_adapter_t *adtr, const uint32_t iv_low_ptn, const uint32_t iv_high_ptn,
		uint8_t dec_region_sel)
{
	hal_status_t ret = HAL_OK;
	if (adtr == NULL) {
		ret = HAL_ERR_MEM;
		return ret;
	}
	if (dec_region_sel >= FLASH_SEC_DECRYPT_REGION_MAX) {
		ret = HAL_ERR_PARA;
		return ret;
	}

	adtr->iv_low  = iv_low_ptn;
	adtr->iv_high = iv_high_ptn;
	adtr->iv_sel  = dec_region_sel;
	ret = hal_rtl_flash_sec_set_iv(adtr);
	return ret;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_decrypt_region_enable(hal_flash_sec_adapter_t *adtr, const uint8_t cipher_sel,
		uint32_t dec_base, uint32_t dec_size, uint32_t tag_base)
{
	hal_status_t ret = HAL_OK;
	uint8_t dec_region_sel = 0x0;
	if (adtr == NULL) {
		ret = HAL_ERR_MEM;
		return ret;
	}

	dec_region_sel = (adtr->iv_sel);
	// check options
	if (dec_region_sel >= FLASH_SEC_DECRYPT_REGION_MAX) {
		ret = HAL_ERR_PARA;
		return ret;
	}
	if (hal_rtl_flash_sec_check_addr_region(dec_base, dec_size)) {
		return HAL_ERR_PARA;
	}
	if (adtr->cipher >= FLASH_SEC_CIPHER_MAX) {
		return HAL_ERR_PARA;
	}

	adtr->decrypt_region_sel = dec_region_sel;
	adtr->decrypt_region_enable = ENABLE;
	adtr->cipher   = cipher_sel;
	adtr->dec_base = dec_base;
	adtr->decrypt_region_size = dec_size;
	ret = hal_rtl_flash_sec_decrypt_region(adtr);
	if (ret != HAL_OK) {
		return ret;
	}

	if (FLASH_SEC_CIPHER_GCM == cipher_sel) {
		hal_rtl_flash_sec_set_tag_base(tag_base);
	}

	// Set Flash SEC Cipher engine enable
	hal_rtl_flash_sec_aes_enable();
	return ret;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_disable_dec_region(hal_flash_sec_adapter_t *adtr, uint8_t dec_region_sel)
{
	hal_status_t ret = HAL_OK;
	if (adtr == NULL) {
		ret = HAL_ERR_MEM;
		return ret;
	}
	adtr->decrypt_region_sel = dec_region_sel;
	ret = hal_rtl_flash_sec_disable_decrypt_region(adtr);
	return ret;
}
#endif

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_disable_decrypt_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->decrypt_region_sel;
	switch (region_id) {
	case 0:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION0_END_REG, FLASH_SEC_BIT_REGN_0_ENABLE);
		break;
	case 1:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION1_END_REG, FLASH_SEC_BIT_REGN_1_ENABLE);
		break;
	case 2:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION2_END_REG, FLASH_SEC_BIT_REGN_2_ENABLE);
		break;
	case 3:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION3_END_REG, FLASH_SEC_BIT_REGN_3_ENABLE);
		break;
	case 4:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION4_END_REG, FLASH_SEC_BIT_REGN_4_ENABLE);
		break;
	case 5:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION5_END_REG, FLASH_SEC_BIT_REGN_5_ENABLE);
		break;
	case 6:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION6_END_REG, FLASH_SEC_BIT_REGN_6_ENABLE);
		break;
	case 7:
		HAL_CLEAR_BIT(flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION7_END_REG, FLASH_SEC_BIT_REGN_7_ENABLE);
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_get_remap_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->remap_region_sel;
	u32 addr_val = 0;
	u32 offset_val = 0;
	switch (region_id) {
	case 0:
		addr_val   = flash_sec_regs->FLASH_SEC_SEC_REMAP0_ADDR_REG;
		offset_val = flash_sec_regs->FLASH_SEC_SEC_REMAP0_OFFSET_REG;
		break;
	case 1:
		addr_val   = flash_sec_regs->FLASH_SEC_SEC_REMAP1_ADDR_REG;
		offset_val = flash_sec_regs->FLASH_SEC_SEC_REMAP1_OFFSET_REG;
		break;
	case 2:
		addr_val   = flash_sec_regs->FLASH_SEC_SEC_REMAP2_ADDR_REG;
		offset_val = flash_sec_regs->FLASH_SEC_SEC_REMAP2_OFFSET_REG;
		break;
	case 3:
		addr_val   = flash_sec_regs->FLASH_SEC_SEC_REMAP3_ADDR_REG;
		offset_val = flash_sec_regs->FLASH_SEC_SEC_REMAP3_OFFSET_REG;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	adtr->remap_region_enable = (offset_val & FLASH_SEC_BIT_REMAP_0_ENABLE) >> FLASH_SEC_SHIFT_REMAP_0_ENABLE;
	adtr->va_base = (addr_val & FLASH_SEC_MASK_REMAP_BASE_0_ADDR) >> FLASH_SEC_SHIFT_REMAP_BASE_0_ADDR << PAGE_SHIFT;
	adtr->pa_base = (offset_val & FLASH_SEC_MASK_REMAP_0_OFFSET) >> FLASH_SEC_SHIFT_REMAP_0_OFFSET << PAGE_SHIFT;
	u32 va_end = (addr_val & FLASH_SEC_MASK_REMAP_END_0_ADDR) >> FLASH_SEC_SHIFT_REMAP_END_0_ADDR << PAGE_SHIFT;
	adtr->remap_region_size = va_end - adtr->va_base;
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_get_decrypt_region(hal_flash_sec_adapter_t *adtr)
{
	u8 region_id = adtr->decrypt_region_sel;
	u32 base_val = 0;
	u32 end_val = 0;
	switch (region_id) {
	case 0:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION0_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION0_END_REG;
		break;
	case 1:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION1_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION1_END_REG;
		break;
	case 2:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION2_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION2_END_REG;
		break;
	case 3:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION3_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION3_END_REG;
		break;
	case 4:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION4_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION4_END_REG;
		break;
	case 5:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION5_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION5_END_REG;
		break;
	case 6:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION6_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION6_END_REG;
		break;
	case 7:
		base_val = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION7_BASE_REG;
		end_val  = flash_sec_regs->FLASH_SEC_SEC_CIPHER_REGION7_END_REG;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	adtr->decrypt_region_enable = (end_val & FLASH_SEC_BIT_REMAP_0_ENABLE) >> FLASH_SEC_SHIFT_REGN_0_ENABLE;
	adtr->cipher = (end_val & FLASH_SEC_MASK_REGN_0_MODE) >> FLASH_SEC_SHIFT_REGN_0_MODE;
	adtr->iv_sel = (end_val & FLASH_SEC_MASK_REGN_0_IV_NUM) >> FLASH_SEC_SHIFT_REGN_0_IV_NUM;
	adtr->va_base = (base_val & FLASH_SEC_MASK_REGN_0_BASE) >> FLASH_SEC_SHIFT_REGN_0_BASE << PAGE_SHIFT;
	u32 va_end = (base_val & FLASH_SEC_MASK_REGN_0_END) >> FLASH_SEC_SHIFT_REGN_0_END << PAGE_SHIFT;
	adtr->decrypt_region_size = va_end - adtr->va_base;
	return HAL_OK;
}

SECTION_FLASHSEC_TEXT
void hal_rtl_flash_sec_get_tag_base(u32 *tag_base)
{
	*tag_base = flash_sec_regs->FLASH_SEC_SEC_GCM_TAG_BASE_REG;
}

SECTION_FLASHSEC_TEXT
hal_status_t hal_rtl_flash_sec_get_iv(hal_flash_sec_adapter_t *adtr)
{
	u8 iv_sel = adtr->iv_sel;
	u32 iv_low = 0;
	u32 iv_high = 0;

	switch (iv_sel) {
	case 0:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV0_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV0_HIGH_REG;
		break;
	case 1:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV1_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV1_HIGH_REG;
		break;
	case 2:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV2_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV2_HIGH_REG;
		break;
	case 3:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV3_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV3_HIGH_REG;
		break;
	case 4:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV4_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV4_HIGH_REG;
		break;
	case 5:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV5_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV5_HIGH_REG;
		break;
	case 6:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV6_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV6_HIGH_REG;
		break;
	case 7:
		iv_low =  flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV7_LOW_REG;
		iv_high = flash_sec_regs->FLASH_SEC_SEC_CIPHER_IV7_HIGH_REG;
		break;
	default:
		return HAL_ERR_PARA;
		break;
	}
	adtr->iv_low = iv_low;
	adtr->iv_high = iv_high;
	return HAL_OK;
}

#endif // end of "#if CONFIG_FLASHSEC_EN"
